// Якщо документ готовий (завантажився)
$(document).ready(function(){
    // Отримуємо усі кнокпи та застосвувємо функцію для кожної з них
    $('.add-to-favorite').each(function(){
        // Звертаємося до поточної кнопки та задаємо подію натискання
        $(this).on('click', function(){
            // Створюємо AJAX-запит, щоб зробити запит на севрер без перезавантаження сторінки
            $.ajax({
                // url, на який треба зробити запит (беремо з атрибута value натиснутої кнопки)
                url: $(this).val(),
                // Тип запиту
                type: 'get',
                // Якщо запит надіслано та від сервера прийде відповідь про успіх 
                success: function(){
                    console.log('success');
                }
            });
        });
    });
});